# This is a header

### This is a subheader with some **bold text** and some *italic*

In [1]:
import pandas as pd
import numpy as np

In [2]:
# View > Terminal
# Then click Jupyter tab, and you'll be able to see live updated variables from the ongoing interactive session
a_list = [1,2,3]

In [3]:
a_list[1] = 5

In [4]:
# Individual cells can be ran at-will. Run the cells two steps up and then this cell again - what does 'a_list' print now?
print(a_list)

[1, 5, 3]

In [5]:
b = "Hello"

In [6]:
df = pd.read_csv("teachers.csv") # df is short for dataframe

In [7]:
dict = {"name": ["Björn"], "age": ["29"]}
# Note the list syntax for the dict values.
# If the lists had two values each, pd.DataFrame(dict) would return a dataframe with two rows.

In [8]:
# A single variable or a function with a return value that's not stored will be caught by the Jupyter session and displayed.
df

      name  teaching     modules  age
0  Matteus      True         5,9   25
1    Peter      True  1,2,3,7,10   26
2     Tony      True       4,6,8   27
3    Tomas     False         NaN   28

In [13]:
# Concatenate two dataframes, making the dictionary a dataframe as well
merged_df = pd.concat([df, pd.DataFrame(dict)], ignore_index=True)
merged_df

      name teaching     modules age
0  Matteus     True         5,9  25
1    Peter     True  1,2,3,7,10  26
2     Tony     True       4,6,8  27
3    Tomas    False         NaN  28
4    Björn      NaN         NaN  29

In [10]:
merged_df.isna() # Where are the NaN values?

    name  teaching  modules    age
0  False     False    False  False
1  False     False    False  False
2  False     False    False  False
3  False     False     True  False
4  False      True     True  False

In [11]:
# Pass the previous matrix to .any() method on axis='columns' ("across columns", that is, rows)
merged_df.isna().any(axis='columns')

# "Which rows have one or more NaN values in them?"

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [12]:
# Use the above boolean series to index in the original dataframe:
merged_df[merged_df.isna().any(axis='columns')]

# Result: A selection of the rows from the merged_df DataFrame that have NaN values in them.

    name teaching modules age
3  Tomas    False     NaN  28
4  Björn      NaN     NaN  29